## Terraform Plan - `dev`

**📊 Plan Summary**
```
Plan: 74 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + cluster_arn      = (known after apply)
  + cluster_endpoint = (known after apply)
  + cluster_id       = (known after apply)
  + cluster_name     = "mbocak-microservices-demo"
  + private_subnets  = [
      + (known after apply),
      + (known after apply),
    ]
```

<details>
<summary>📋 Show Full Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.retency_policy will be created
  + resource "aws_ecr_lifecycle_policy" "retency_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 tagged images (multi-arch safe)"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "invoice-",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 1 day"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + region      = "eu-west-1"
      + registry_id = (known after apply)
      + repository  = "mbocak-microservices-demo"
    }

  # aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "mbocak-microservices-demo"
      + region               = "eu-west-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all             = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
    }

  # aws_eks_pod_identity_association.ebs_csi_driver will be created
  + resource "aws_eks_pod_identity_association" "ebs_csi_driver" {
      + association_arn      = (known after apply)
      + association_id       = (known after apply)
      + cluster_name         = "mbocak-microservices-demo"
      + disable_session_tags = false
      + external_id          = (known after apply)
      + id                   = (known after apply)
      + namespace            = "kube-system"
      + region               = "eu-west-1"
      + role_arn             = (known after apply)
      + service_account      = "ebs-csi-controller-sa"
      + tags                 = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all             = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
    }

  # aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mbocak-microservices-demo-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::910681227783:policy/DefaultBoundaryPolicy"
      + tags                  = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all              = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ebs_csi_driver will be created
  + resource "aws_iam_role" "ebs_csi_driver" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRole",
                          + "sts:TagSession",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "pods.eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mbocak-microservices-demo-ebs-csi-driver-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::910681227783:policy/DefaultBoundaryPolicy"
      + tags                  = {
          + "Name"    = "mbocak-microservices-demo-ebs-csi-driver-role"
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all              = {
          + "Name"    = "mbocak-microservices-demo-ebs-csi-driver-role"
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.node will be created
  + resource "aws_iam_role" "node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "mbocak-microservices-demo-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::910681227783:policy/DefaultBoundaryPolicy"
      + tags                  = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all              = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.cluster_policies["arn:aws:iam::aws:policy/AmazonEKSBlockStoragePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSBlockStoragePolicy"
      + role       = "mbocak-microservices-demo-cluster-role"
    }

  # aws_iam_role_policy_attachment.cluster_policies["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "mbocak-microservices-demo-cluster-role"
    }

  # aws_iam_role_policy_attachment.cluster_policies["arn:aws:iam::aws:policy/AmazonEKSComputePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSComputePolicy"
      + role       = "mbocak-microservices-demo-cluster-role"
    }

  # aws_iam_role_policy_attachment.cluster_policies["arn:aws:iam::aws:policy/AmazonEKSLoadBalancingPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSLoadBalancingPolicy"
      + role       = "mbocak-microservices-demo-cluster-role"
    }

  # aws_iam_role_policy_attachment.cluster_policies["arn:aws:iam::aws:policy/AmazonEKSNetworkingPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSNetworkingPolicy"
      + role       = "mbocak-microservices-demo-cluster-role"
    }

  # aws_iam_role_policy_attachment.ebs_csi_driver_policy will be created
  + resource "aws_iam_role_policy_attachment" "ebs_csi_driver_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "mbocak-microservices-demo-ebs-csi-driver-role"
    }

  # aws_iam_role_policy_attachment.node_policies["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "node_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "mbocak-microservices-demo-node-role"
    }

  # aws_iam_role_policy_attachment.node_policies["arn:aws:iam::aws:policy/AmazonEKSWorkerNodeMinimalPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "node_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodeMinimalPolicy"
      + role       = "mbocak-microservices-demo-node-role"
    }

  # aws_s3_bucket.test_bucket will be destroyed
  # (because aws_s3_bucket.test_bucket is not in configuration)
  - resource "aws_s3_bucket" "test_bucket" {
      - arn                         = "arn:aws:s3:::mbocak-tf-connection-test-bucket" -> null
      - bucket                      = "mbocak-tf-connection-test-bucket" -> null
      - bucket_domain_name          = "mbocak-tf-connection-test-bucket.s3.amazonaws.com" -> null
      - bucket_region               = "eu-west-1" -> null
      - bucket_regional_domain_name = "mbocak-tf-connection-test-bucket.s3.eu-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
      - id                          = "mbocak-tf-connection-test-bucket" -> null
      - object_lock_enabled         = false -> null
      - region                      = "eu-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Environment" = "dev"
          - "Name"        = "TF Test Bucket"
        } -> null
      - tags_all                    = {
          - "Environment" = "dev"
          - "Name"        = "TF Test Bucket"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "fe47c434a5dbcf5d77aad962f0337d00f75d6c3fb3dbb1768f9055a21de6058c" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/eks/mbocak-microservices-demo/cluster"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags                        = {
          + "Name"    = "/aws/eks/mbocak-microservices-demo/cluster"
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all                    = {
          + "Name"    = "/aws/eks/mbocak-microservices-demo/cluster"
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["env"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "env"
      + region      = "eu-west-1"
      + resource_id = (known after apply)
      + value       = "dev"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["owner"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "owner"
      + region      = "eu-west-1"
      + resource_id = (known after apply)
      + value       = "mbocak"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["project"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "project"
      + region      = "eu-west-1"
      + resource_id = (known after apply)
      + value       = "k8s-microservices-demo"
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = (known after apply)
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::910681227783:user/mbocak"
      + region            = "eu-west-1"
      + tags              = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all          = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = (known after apply)
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::910681227783:user/mbocak"
      + region        = "eu-west-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "eu-west-1"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all                    = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "eu-west-1"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all                    = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "eu-west-1"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all                    = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "eu-west-1"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all                    = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = false
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "mbocak-microservices-demo"
      + platform_version              = (known after apply)
      + region                        = "eu-west-1"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "env"                   = "dev"
          + "owner"                 = "mbocak"
          + "project"               = "k8s-microservices-demo"
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                      = {
          + "env"                   = "dev"
          + "owner"                 = "mbocak"
          + "project"               = "k8s-microservices-demo"
          + "terraform-aws-modules" = "eks"
        }
      + version                       = "1.34"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + compute_config {
          + enabled       = true
          + node_pools    = [
              + "general-purpose",
            ]
          + node_role_arn = (known after apply)
        }

      + control_plane_scaling_config (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing {
              + enabled = true
            }
        }

      + storage_config {
          + block_storage {
              + enabled = true
            }
        }

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "mbocak-microservices-demo-cluster-ClusterEncryption"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all         = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
    }

  # module.eks.aws_iam_policy.custom[0] will be created
  + resource "aws_iam_policy" "custom" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "mbocak-microservices-demo-cluster-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ec2:RunInstances",
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                          + StringLike   = {
                              + "aws:RequestTag/eks:kubernetes-node-class-name" = "*"
                              + "aws:RequestTag/eks:kubernetes-node-pool-name"  = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "Compute"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                          + "ec2:CreateSnapshot",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                      + Sid       = "Storage"
                    },
                  + {
                      + Action    = "ec2:CreateNetworkInterface"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name"         = "${aws:PrincipalTag/eks:eks-cluster-name}"
                              + "aws:RequestTag/eks:kubernetes-cni-node-name" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "Networking"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateListener",
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "LoadBalancer"
                    },
                  + {
                      + Action    = "shield:CreateProtection"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ShieldProtection"
                    },
                  + {
                      + Action    = "shield:TagResource"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:shield::*:protection/*"
                      + Sid       = "ShieldTagResource"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all         = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
    }

  # module.eks.aws_iam_role.eks_auto[0] will be created
  + resource "aws_iam_role" "eks_auto" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSAutoNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "mbocak-microservices-demo-eks-auto-"
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::910681227783:policy/DefaultBoundaryPolicy"
      + tags                  = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all              = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "mbocak-microservices-demo-cluster-"
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::910681227783:policy/DefaultBoundaryPolicy"
      + tags                  = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all              = {
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.eks_auto["AmazonEC2ContainerRegistryPullOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "eks_auto" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPullOnly"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.eks_auto["AmazonEKSWorkerNodeMinimalPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "eks_auto" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodeMinimalPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSBlockStoragePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSBlockStoragePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSComputePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSComputePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSLoadBalancingPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSLoadBalancingPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSNetworkingPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSNetworkingPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "mbocak-microservices-demo-cluster-"
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "mbocak-microservices-demo-cluster"
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + tags_all               = {
          + "Name"    = "mbocak-microservices-demo-cluster"
          + "env"     = "dev"
          + "owner"   = "mbocak"
          + "project" = "k8s-microservices-demo"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "mbocak-microservices-demo-node-"
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                            = "mbocak-microservices-demo-node"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "owned"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + tags_all               = {
          + "Name"                                            = "mbocak-microservices-demo-node"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "owned"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_10251_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 10251/tcp webhook"
      + from_port                = 10251
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10251
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "udp"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "certificate_authority_data" = (known after apply)
          + "endpoint"                   = (known after apply)
          + "kubernetes_version"         = "1.34"
          + "name"                       = (known after apply)
          + "service_cidr"               = (known after apply)
        }
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + tags                   = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-default"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + tags_all               = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-default"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + route                  = (known after apply)
      + tags                   = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-default"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + tags_all               = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-default"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-default"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + tags_all               = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-default"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "eu-west-1"
      + tags                 = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-eu-west-1a"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + tags_all             = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-eu-west-1a"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "eu-west-1"
      + tags     = {
          + "Name"                                            = "mbocak-microservices-demo-vpc"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + tags_all = {
          + "Name"                                            = "mbocak-microservices-demo-vpc"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + auto_provision_zones               = (known after apply)
      + auto_scaling_ips                   = (known after apply)
      + availability_mode                  = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "eu-west-1"
      + regional_nat_gateway_address       = (known after apply)
      + regional_nat_gateway_auto_mode     = (known after apply)
      + route_table_id                     = (known after apply)
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-eu-west-1a"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + tags_all                           = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-eu-west-1a"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + vpc_id                             = (known after apply)
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "eu-west-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "eu-west-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-west-1"
      + route            = (known after apply)
      + tags             = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-private"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + tags_all         = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-private"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-west-1"
      + route            = (known after apply)
      + tags             = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-public"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + tags_all         = {
          + "Name"                                            = "mbocak-microservices-demo-vpc-public"
          + "env"                                             = "dev"
          + "kubernetes.io/cluster/mbocak-microservices-demo" = "shared"
          + "owner"                                           = "mbocak"
          + "project"                                         = "k8s-microservices-demo"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known afte

  ... (output truncated - check artifact for full plan)
```

</details>

---
*Updated at: 2025-12-05T13:57:16Z*
<!-- Sticky Pull Request Commentterraform-plan-dev -->